local dashboard_config = {
  preset = {
    header = {
      [[
 ██▀███      ▄▄▄          ██▓      ,-.       _,---._ __  / \   
▓██ ▒ ██▒   ▒████▄       ▓██▒     /  )    .-'       `./ /   \  
▓██ ░▄█ ▒   ▒██  ▀█▄     ▒██▒    (  (   ,'            `/    /| 
▒██▀▀█▄     ░██▄▄▄▄██    ░██░     \  `-"             \'\   / | 
░██▓ ▒██▒    ▓█   ▓██▒   ░██░      `.              ,  \ \ /  | 
░ ▒▓ ░▒▓░    ▒▒   ▓▒█░   ░▓         /`.          ,'-`----Y   | 
  ░▒ ░ ▒░     ▒   ▒▒ ░    ▒ ░      (            ;        |   ' 
  ░░   ░      ░   ▒       ▒ ░      |  ,-.    ,-'         |  /  
   ░              ░  ░    ░        |  | (   |        ane | /   
                                   )  |  \  `.___________|/    
                                   `--'   `--'                 
          ]],
    },
    -- header = {
    --   [[
    --
    -- ██▀███   ▄▄▄       ██▓ ▄▄▄       ███▄    █ ▓█████
    -- ▓██ ▒ ██▒▒████▄    ▓██▒▒████▄     ██ ▀█   █ ▓█   ▀
    -- ▓██ ░▄█ ▒▒██  ▀█▄  ▒██▒▒██  ▀█▄  ▓██  ▀█ ██▒▒███
    -- ▒██▀▀█▄  ░██▄▄▄▄██ ░██░░██▄▄▄▄██ ▓██▒  ▐▌██▒▒▓█  ▄
    -- ░██▓ ▒██▒ ▓█   ▓██▒░██░ ▓█   ▓██▒▒██░   ▓██░░▒████▒
    -- ░ ▒▓ ░▒▓░ ▒▒   ▓▒█░░▓   ▒▒   ▓▒█░░ ▒░   ▒ ▒ ░░ ▒░ ░
    --   ░▒ ░ ▒░  ▒   ▒▒ ░ ▒ ░  ▒   ▒▒ ░░ ░░   ░ ▒░ ░ ░  ░
    --   ░░   ░   ░   ▒    ▒ ░  ░   ▒      ░   ░ ░    ░
    --   ░           ░  ░ ░        ░  ░         ░    ░  ░
    --   ]],
    -- },
    -- header = {
    --   [[
    --
    --
    --  ███▄    █     ▒█████      ██▓    ▄████▄     ▓█████
    --  ██ ▀█   █    ▒██▒  ██▒   ▓██▒   ▒██▀ ▀█     ▓█   ▀
    -- ▓██  ▀█ ██▒   ▒██░  ██▒   ▒██▒   ▒▓█    ▄    ▒███
    -- ▓██▒  ▐▌██▒   ▒██   ██░   ░██░   ▒▓▓▄ ▄██▒   ▒▓█  ▄
    -- ▒██░   ▓██░   ░ ████▓▒░   ░██░   ▒ ▓███▀ ░   ░▒████▒
    -- ░ ▒░   ▒ ▒    ░ ▒░▒░▒░    ░▓     ░ ░▒ ▒  ░   ░░ ▒░ ░
    -- ░ ░░   ░ ▒░     ░ ▒ ▒░     ▒ ░     ░  ▒       ░ ░  ░
    --    ░   ░ ░    ░ ░ ░ ▒      ▒ ░   ░              ░
    --          ░        ░ ░      ░     ░ ░            ░  ░
    --                                  ░                    ]],
    -- },
    keys = {
      {
        icon = " ",
        key = "c",
        desc = "Config",
        action = ":lua Snacks.dashboard.pick('files', {cwd = vim.fn.stdpath('config')})",
      },
      { icon = " ", key = "p", desc = "Projects", action = ":lua Snacks.picker.projects()" },
      { icon = " ", key = "s", desc = "Restore Session", section = "session" },
      { icon = " ", key = "q", desc = "Quit", action = ":qa" },
    },
  },

  sections = {
    -- {
    --   pane = 2,
    --   section = "terminal",
    --   cmd = "pokemon-colorscripts -r --no-title; sleep .1",
    --   height = 30,
    --   random = 10,
    --   indent = 4,
    -- },
    {
      pane = 1,
      { section = "header" },
      { section = "keys", gap = 1, padding = 1 },
      { section = "startup" },
    },
    -- {
    --   pane = 2,
    --   section = "keys",
    --   gap = 1,
    --   padding = 1,
    -- },
  },
}

return {
  {
    "folke/snacks.nvim",
    ---@type snacks.Config
    opts = {
      dashboard = dashboard_config,
      indent = {
        enabled = false,
      },
      explorer = {
        enabled = false,
      },
      zen = {
        enabled = false,
      },
      image = {
        enabled = false,
      },
    },
  },
  {
    "akinsho/bufferline.nvim",
    opts = {
      options = {
        always_show_bufferline = true,
        hover = {
          enabled = true,
          delay = 200,
          reveal = { "close" },
        },
        separator_style = "slope",
      },
    },
  },
  {
    "nvim-lualine/lualine.nvim",
    event = "VeryLazy",
    opts = function()
      return {
        sections = {
          lualine_c = {
            "filename",
          },
        },
      }
    end,
  },
  -- {
  --   "sphamba/smear-cursor.nvim",
  --   opts = {},
  -- },
}
